{
  "mspcmanagerhelper": "MSPCManagerHelper",

  "__i18n_name_list__": "Language Name List",
    "lang_en-us": "English (United States)",
    "lang_zh-cn": "中文 (简体)",
    "lang_zh-tw": "中文 (繁體)",

  "__localization_translator_list__": "Localization Translator List (GitHub Profile Name: Display Nickname)",
    "Goo-aw233": "GuCATs",
  "__localization_translator_list_end__": "This is the end marker for the localization translator list. Please do not delete this line.",

  "__initialization__": "Initialization Section",
    "administrator_protection_is_enabled": "Administrator Protection is enabled, some features may not work properly. Please disable Administrator Protection and restart Windows to continue.",
    "administrator_required": "Administrator Required",
    "copy": "Copy",
    "error": "Error",
    "error_code": "Error Code",
    "error_message": "Error Message",
    "exception_context": "Exception Context",
    "execute": "Execute",
    "info": "Info",
    "narrator_is_running": "The Narrator or another screen reader is running. Program cannot be read aloud properly at this time. Please seek assistance from someone else to continue.",
    "operating_system_is_not_windows_nt_based": "The operating system is not Windows NT-based. The program will exit.",
    "program_is_not_running_as_administrator": "MSPCManagerHelper is not running as Administrator, some features will be disabled. Please select 'Run as Administrator' from the program's 'Home' section to continue.",
    "refresh": "Refresh",
    "return_code": "Return Code",
    "stdout": "Standard Output",
    "stderr": "Standard Error",
    "warning": "Warning",
    "windows_feature_experience_pack": "Windows Feature Experience Pack",
    "windows_server_installation_type_is_core": "The current Windows Server installation type is not a Windows Server with Desktop Experience, and some features may not work properly. Please reinstall Windows Server with Desktop Experience to continue.",

  "__navigation__": "Navigation Section",
    "about_page": "About",
    "home_page": "Home",
    "installer_page": "Installer",
    "maintenance_page": "Maintenance",
    "toolbox_page": "Toolbox",
    "uninstaller_page": "Uninstaller",
    "utilities_page": "Utilities",

  "__about_page__": "About Section",
    "get_help": "Get Help",
    "get_help_description": "You Will Be Redirected to the Official Website of Microsoft PC Manager, Please Contact Us from the More Contact Section At the Bottom of the Website to Get Help",
    "localization_translator": "Localization Translator",
    "official_website": "Official Website",
    "official_website_description": "Microsoft PC Manager Official Website, You Can Get the Latest Version of Microsoft PC Manager and Related Information from Here",
    "open_source_license": "Open Source License",
    "privacy_policy": "Privacy Policy",
    "privacy_policy_content": "MSPCManagerHelper (hereinafter referred to as \"the Software\") does not collect or upload any data in any form, including but not limited to computer identifiers, geographic information, etc. All data collection while using the Software is performed by Microsoft® Windows® Operating System and software such as Microsoft PC Manager.\n\nThe software has the \"Support Developer\" option checked by default. This option will add the \"Microsoft Student Ambassadors\" tracking code when you visit certain Microsoft links (e.g., https://learn.microsoft.com/?wt.mc_id=studentamb_474966) to help developers track visitor traffic. All tracking services will be performed by Microsoft when you visit the relevant websites.",
    "privacy_settings": "Privacy & Security",
    "privacy_settings_button_tooltip": "Manage Windows privacy options and app permissions.",
    "privacy_settings_description": "Open the Privacy & Security In Windows Settings",
    "program_download_channel": "Program Download Channel",
    "program_information": "Program Information",
    "program_version": "Program Version",
    "project_contributors": "Project Contributors",
    "project_source_code_repo": "Project Source Code Repository",
    "redirect_to_official_website_to_get_help": "You will be redirected to the official website of Microsoft PC Manager. Please contact us from the More Contact section at the bottom of the website to get help.",
    "terms_of_use": "Term of Use",
    "terms_of_use_content": "Welcome to MSPCManagerHelper (hereinafter referred to as \"the Software\"). Please carefully read the following terms of use (hereinafter referred to as \"the Terms\") before using the Software. By any ways to downloading, installing, or using the Software, you agree to comply with these Terms. If you do not agree with these Terms, please do not use the Software. Terms are subject to change without notice.\n\nTerms Modification Date: December 22, 2024\n\n1. License to Use\nThe Software is licensed to you by individual developer GuCATs (hereinafter referred to as \"the Developer\") for personal, non-commercial use only. You may not copy, modify, distribute, sell, or lease any part of the Software without the Developer's written permission.\n\n2. Intellectual Property\nThe Software and all its content (including but not limited to text, images, icons, interfaces, code, and trademarks) are protected by copyright laws and other intellectual property laws. The Developer reserves all rights not expressly granted.\n\n3. User Responsibility\nYou agree to comply with all applicable laws and regulations while using the Software. You may not use the Software for any illegal activities or infringe upon the rights of others.\n\n4. Privacy Policy\nThe Developer respects your privacy and is committed to protecting your personal information. For detailed information on how we collect, use, and protect your information, please refer to our [Privacy Policy].\n\n5. Disclaimer\nThe Software is provided \"as is\" without any express or implied warranties, including but not limited to warranties of merchantability, fitness for a particular purpose, and non-infringement. The Developer does not guarantee that the functions of the Software will meet your requirements or that the operation of the Software will be uninterrupted or error-free. The Developer is not responsible for any issues arising from the use of the Software.\n\n6. Limitation of Liability\nTo the maximum extent permitted by applicable law, the Developer shall not be liable for any direct, indirect, incidental, special, or consequential damages resulting from the use or inability to use the Software, even if the Developer has been advised of the possibility of such damages.\n\n7. Modification of Terms\nThe Developer reserves the right to modify these Terms at any time. The modified Terms will take effect immediately upon being posted in the Software or on the Developer's website. Your continued use of the Software signifies your acceptance of the modified Terms.\n\n8. Termination\nIf you violate these Terms, the Developer reserves the right to immediately terminate your license to use the Software without prior notice.\n\n9. Governing Law\nThese Terms are governed by the laws of [Country/Region], without regard to its conflict of law principles.\n\n10. Open Source License\nThe Software uses the MIT open-source license. You can view the details at [MIT License](https://github.com/Goo-aw233/MSPCManagerHelper/blob/main/LICENSE.txt).\n\n11. Third-Party Software\n[NSudo](https://github.com/M2TeamArchived/NSudo).\n[Sysinternals](https://learn.microsoft.com/sysinternals/license-terms/?wt.mc_id=studentamb_474966).",

  "__home_page__": "Home Section",
    "about_windows_button_tooltip": "Open the About Windows to view the current Windows version and other related information.",
    "about_windows_in_mssettings": "About Windows",
    "check_system_requirements": "Check System Requirements",
    "cleanup_after_exit": "Cleanup After Exit",
    "cleanup_after_exit_description": "Delete Temporary Files and Logs Generated By the Program After Closing the Program",
    "cleanup_after_exit_tooltip": "Enabling this option will make program delete all generated temporary files and logs upon exit to clear all usage history as much as possible (Needs to be run as administrator).",
    "compatibility_mode": "Compatibility Mode",
    "compatibility_mode_description": "Make the Program Use Legacy Commands to Execute Certain Features, Improving Compatibility With Older Versions of Windows, However, This May Cause Some Features to Not Function Properly, Enable This Option Only If You Encounter Issues",
    "compatibility_mode_tooltip": "Enabling this option will make the program attempt to use legacy commands for execution to improve compatibility, which may lead to performance degradation.",
    "current_microsoft_pc_manager_beta_version_number": "Current Microsoft PC Manager Public Beta Version Number",
    "current_microsoft_pc_manager_version_number": "Current Microsoft PC Manager Version Number",
    "current_system_meet_system_requirements": "The Current System Meets the Minimum System Requirements for Microsoft PC Manager",
    "current_system_not_meet_system_requirements": "The Current System Does Not Meet the Minimum System Requirements for Microsoft PC Manager: Windows 10 Version 20H2 (Build 19042), Windows Server 2022 with Desktop Experience or Later",
    "dark_theme": "Dark Theme",
    "exit_program": "Exit Program",
    "exit_program_description": "Close and Exit the Program",
    "failed_to_get_microsoft_pc_manager_version_number": "Currently Unable to Obtain the Microsoft PC Manager Version Number, Which May be Due to Microsoft PC Manager Not Being Installed or Installed Incorrectly",
    "failed_to_run_as_administrator": "Failed to restart as administrator. Please manually run program as administrator to enable all features.",
    "home_page_introduction": "Welcome to MSPCManagerHelper!\nThis program is designed to help you manage Microsoft PC Manager. Please select a feature from the navigation menu to continue. Before using MSPCManagerHelper, please read the Terms of Use and Privacy Policy carefully. By continuing to use, you agree to these terms.",
    "introduction": "Introduction",
    "light_theme": "Light Theme",
    "long_paths_enabled_button": "Enable Long Paths",
    "long_paths_enabled_button_tooltip": "Enable for file paths longer than 260 characters.",
    "long_paths_not_enabled": "Long Paths Not Enabled",
    "match_system_theme": "Match System Theme",
    "microsoft_pc_manager_version_infomation": "Microsoft PC Manager Version Information",
    "program_language": "Program Language",
    "program_language_description": "Select the Display Language Used by Program",
    "program_settings": "Program Settings",
    "program_theme": "Program Theme",
    "program_theme_description": "Select the Display Theme Used by Program",
    "refresh_mspcm_version_button_tooltip": "Reacquire the Microsoft PC Manager version number.",
    "restart_program": "Restart",
    "restart_program_description": "Retain Parameters and Restart the Program",
    "restart_program_disabled_tooltip": "Only available when running in EXE mode.",
    "run_as_administrator": "Run as Administrator",
    "run_as_administrator_description": "Restart Program as Administrator to Enable All Features",
    "run_as_admin_button_tooltip": "Retain parameters and rerun the program as administrator.",
    "start_microsoft_pc_manager": "Start Microsoft PC Manager",
    "start_microsoft_pc_manager_beta": "Start Microsoft PC Manager Public Beta",
    "support_developer": "Support Developer",
    "support_developer_checkbutton_tooltip": "Visit https://learn.microsoft.com/training/student-hub/become-a-student-ambassador/?wt.mc_id=studentamb_474966 for more information.",
    "support_developer_description": "A Microsoft Student Ambassadors Tracking Code Will be Added When You Visit Certain Microsoft Links to Help Developers Track Visitor Traffic",
    "windows_installation_information": "Windows Installation Information",

  "__installer_page__": "Installer Section",

  "__installer_modules__": "Installer Modules",

  "__maintenance_page__": "Maintenance Section",

  "__maintenance_module__": "Maintenance Modules",

  "__toolbox_page__": "Toolbox Section",
    "download_webview2_runtime": "Download Microsoft Edge WebView2 Runtime",
    "download_webview2_runtime_description": "Download and Install Microsoft Edge WebView2 Runtime to Ensure That Microsoft PC Manager Can Run Properly",
    "download_windows_app_runtime": "Download Windows App Runtime",
    "download_windows_app_runtime_description": "Download and Install Windows App Runtime to Ensure That Microsoft PC Manager's Widgets Can Run Properly",
    "microsoft_pc_manager_update": "Microsoft PC Manager Update",
    "program_update": "Program Update",
    "runtime_download": "Runtime Download",
    "update_from_azure": "Update from Azure Blob",
    "update_microsoft_pc_manager_from_azure_description": "Get the Latest Version of Microsoft PC Manager Application Package from Azure Blob",
    "update_microsoft_pc_manager_from_onedrive_description": "Get the Latest Version of Microsoft PC Manager Application Package from OneDrive",
    "update_from_github": "Update from GitHub",
    "update_from_github_description": "Get the Latest Version of MSPCManagerHelper from GitHub Release",
    "update_from_onedrive": "Update from OneDrive",
    "update_from_onedrive_description": "Get the Latest Version of MSPCManagerHelper from OneDrive",

  "__toolbox_modules__": "Toolbox Modules",

  "__uninstaller_page__": "Uninstaller Section",

  "__uninstaller_modules__": "Uninstaller Modules",

  "__utilities_module__": "Utilities Modules",

  "__utilities_page__": "Utilities Section"
}
